---
kind: method
id: M:Autodesk.Revit.DB.MeshFromGeometryOperationResult.Dispose
source: html/1232a220-124f-f1ed-adcf-9234bf17e2ed.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationResult.Dispose Method

Releases all resources used by the MeshFromGeometryOperationResult

## Syntax (C#)
```csharp
public void Dispose()
```